## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:48" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:48" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:9853ac2e26a11b752c491dba085ec8c82b2790a20b9b2882c293b6af19fb77c9" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:7ec16c1ae4741c87a7f7240d80c1afa2aadcfe5aed8b84ec4d15ff3d030dba8c"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 48 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "941a24008125db82f9a3944a10abe9e9-5" -> "03f26d9515a21efcc51fb0dc9cc27268"
        id                     = "cpfValidation.03f26d9515a21efcc51fb0dc9cc27268.zip"
        tags                   = {}
      ~ version_id             = "CNCzC3BHwbSgtMGtE1q3UKTHPML2j4Os" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "b08aae30188b2349c62ad4146d6e4e5c-6" -> "f12d747e0b78b872f335428cbff9a31b"
        id                     = "excelToJson.f12d747e0b78b872f335428cbff9a31b.zip"
        tags                   = {}
      ~ version_id             = "R0Mi_ydkX_U3Mm_hrliuDIPz4jIog0HP" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "68740da25ff78d9a2f279da657d816d7-6" -> "1e50aff424afada973d824af9d2a113f"
        id                     = "graphql.1e50aff424afada973d824af9d2a113f.zip"
        tags                   = {}
      ~ version_id             = "NZOcOZOuHxSLsM7o5Ev_xrOU6Am_9xQF" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "1fc6cccfc7e8a18bcf6887aa32233f3f" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        id                     = "dist/200.html"
      ~ source_hash            = "1fc6cccfc7e8a18bcf6887aa32233f3f" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        tags                   = {}
      ~ version_id             = "NKbJKjs220dwT4dArff.eB6g..r.ToHM" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "91c82c74dc31e6eec1a45470c6e4a08e" -> "8eacf0ad5ea30fe10f5f0765221734b3"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "91c82c74dc31e6eec1a45470c6e4a08e" -> "8eacf0ad5ea30fe10f5f0765221734b3"
        tags                   = {}
      ~ version_id             = "yyKm4AKGiMTM4rUSjX5IjzjZBBOjtF8F" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "81c7fae9d0ae629cefa3fe60ca1b180b" -> "efb4158acaee6a39e70d443d4cec84e4"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "81c7fae9d0ae629cefa3fe60ca1b180b" -> "efb4158acaee6a39e70d443d4cec84e4"
        tags                   = {}
      ~ version_id             = "GN1WgknnWppfrohAmkRWd2pMe.cNCf8C" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "1fc6cccfc7e8a18bcf6887aa32233f3f" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        id                     = "dist/index.html"
      ~ source_hash            = "1fc6cccfc7e8a18bcf6887aa32233f3f" -> "1fa83e57e551c6bbbfdd5cb841613c0d"
        tags                   = {}
      ~ version_id             = "1Bm1GU8z.OggJUy3dAmvth5n3KnApnnx" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f15abf167ebcb6da979cb68ee9e19ffe"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js"
+       source_hash            = "f15abf167ebcb6da979cb68ee9e19ffe"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a2860e25.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "9806104531a6dc74425d37448a95fecc"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.a2860e25.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a2860e25.js.LICENSE.txt"
+       source_hash            = "9806104531a6dc74425d37448a95fecc"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.dde2c86a.js"] will be destroyed
  # (because key ["static/js/app.dde2c86a.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c55d9dc9ec1aa6fdf292f01ea77b4d85" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.dde2c86a.js" -> null
-       key                    = "dist/static/js/app.dde2c86a.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.dde2c86a.js" -> null
-       source_hash            = "c55d9dc9ec1aa6fdf292f01ea77b4d85" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "jMfxiPy.CJZ5xIlT6_9gePQju9oUEFhc" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.dde2c86a.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.dde2c86a.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "9806104531a6dc74425d37448a95fecc" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.dde2c86a.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.dde2c86a.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.dde2c86a.js.LICENSE.txt" -> null
-       source_hash            = "9806104531a6dc74425d37448a95fecc" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "LoFM3DEAJLJd4d8Rl_5vauvuD9SXNTqO" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:17/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "17" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "a824b5110527b431f0803e5496ee54f4c51a4622" -> "5c8b0967d94b1def39e6b1c0a1a72145fc147f38"
              ~ "DD_TAGS"                      = "git.commit.sha:a824b5110527b431f0803e5496ee54f4c51a4622,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:5c8b0967d94b1def39e6b1c0a1a72145fc147f38,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "a824b5110527b431f0803e5496ee54f4c51a4622" -> "5c8b0967d94b1def39e6b1c0a1a72145fc147f38"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "17" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:17/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "17" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "a824b5110527b431f0803e5496ee54f4c51a4622" -> "5c8b0967d94b1def39e6b1c0a1a72145fc147f38"
              ~ "DD_TAGS"                      = "git.commit.sha:a824b5110527b431f0803e5496ee54f4c51a4622,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:5c8b0967d94b1def39e6b1c0a1a72145fc147f38,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "a824b5110527b431f0803e5496ee54f4c51a4622" -> "5c8b0967d94b1def39e6b1c0a1a72145fc147f38"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "17" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:64" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:64/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "64" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "a824b5110527b431f0803e5496ee54f4c51a4622" -> "5c8b0967d94b1def39e6b1c0a1a72145fc147f38"
              ~ "DD_TAGS"                            = "git.commit.sha:a824b5110527b431f0803e5496ee54f4c51a4622,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:5c8b0967d94b1def39e6b1c0a1a72145fc147f38,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "a824b5110527b431f0803e5496ee54f4c51a4622" -> "5c8b0967d94b1def39e6b1c0a1a72145fc147f38"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "64" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 11 to change, 6 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8098762959)*